mrcodetastic/MBI5153-DMG1075-MatrixPanel-DMA/esp32s2_pio_Arduino_GFX_Lite/src/esp32s2_mbi5135_i2s_lcd_24bit_parallel_dma.cpp
/******************************************************************************************
 * @file        esp32s2_i2s_lcd_24bit_parallel_dma.cpp
 * @author      github.com/mrcodetastic
 * @date        2024
 * @brief       ESP32-S2 implementation for a MBI5135 PWM chip based LED Matrix Panel
 ******************************************************************************************/


#include <sdkconfig.h>

#if !defined (CONFIG_IDF_TARGET_ESP32S2)
  #pragma error "Designed only for ESP32-S2"
#endif

#include "esp32s2_mbi5135_i2s_lcd_24bit_parallel_dma.hpp"

#include <driver/gpio.h>
#if (ESP_IDF_VERSION_MAJOR == 5)
#include <esp_private/periph_ctrl.h>
#else
  #pragma error "ESP IDF >= 5 Required"
#endif

#include <soc/gpio_sig_map.h>
#include <soc/i2s_periph.h> //includes struct and reg

#if defined (ARDUINO_ARCH_ESP32)
#include <Arduino.h>
#endif

#include <esp_err.h>
#include <esp_log.h>

// Get CPU freq function.
#include <soc/rtc.h>
#include <rom/ets_sys.h> // ets delay

// New dma helper tools
//#include "esp_dma_utils.h"
#include "rom/cache.h"

#include "app_constants.h"

// #define USE_PSRAM 1  // You really don't want to do this on the S2 using EDBA, it's shit slow. Max 1Mhz output!

  static const char *TAG = "i2s_24bit_lcd";

  #define ESP32_I2S_DEVICE I2S_NUM_0	

  /*************** Fixed Buffer Serial Bit Pulse Length Values ****************/
  // The length in parallel clocks. Actual memory use will be 3 x this.
  #define BUFF_BITLEN_VSYNC            400    // Half rate data bit length + some clocks for vsync
  #define BUFF_BITLEN_CONFIG           (500)   // Config stuff

  /******** GCLK Calculation Bit Pulse Length and Data - ChatGPT generated **********/
  /* LLM Prompt

  Task Description:
  The goal is to generate and print a series of byte sequences based on the following specifications:

  Each sequence consists of 512 repeats of three bytes.
  In each repeat, the first two bytes are the same and the third byte has its Most Significant Bit (MSB) set to 1.
  Repeat the sequence generation 20 times, embedding the current repeat count (from 0 to 19) in the least significant bits (LSBs) of each byte in the sequence.
  Add 20 zero bytes before and after each sequence, with also has the repeat value in the LSBs.
  Instead of pre-allocating memory for the entire sequence, the byte value at a given position should be calculated on the fly.
  */

  const int BYTES_PER_REPEAT  = 3; // gclk pulse on 3rd byte, gives us enough time to send frame data then.
  const int REPEATS           = 513; // 513 gclks per the documentation
  const int SEQUENCE_SIZE     = BYTES_PER_REPEAT * REPEATS;
  const int REPEAT_COUNT      = 20; // 20 rows
  const int PADDING_SIZE      = 8; // some delay between row changes?
  const int TOTAL_SIZE        = (PADDING_SIZE + SEQUENCE_SIZE + PADDING_SIZE) * REPEAT_COUNT;


  // Generate MBI5153 GCLK DATA for Byte 0 of parallel output.
  // Function to calculate the value of a byte at a specific position
  uint8_t getByteValue(int position) {
      int sequenceIndex = position / (PADDING_SIZE + SEQUENCE_SIZE + PADDING_SIZE);
      int offset = position % (PADDING_SIZE + SEQUENCE_SIZE + PADDING_SIZE);
  /*
      // Handle padding
      if (offset < PADDING_SIZE || offset >= PADDING_SIZE + SEQUENCE_SIZE) {
          return 0x00;
      }
  */
      // Calculate position within the sequence
      int sequencePosition = offset - PADDING_SIZE;
      int byteIndex = sequencePosition % BYTES_PER_REPEAT;

      uint8_t repeatValue = sequenceIndex & 0x1F;  // Repeat value embedded in the LSBs

      // Handle padding
      if (offset < PADDING_SIZE || offset >= PADDING_SIZE + SEQUENCE_SIZE) {
          return repeatValue;
      }    

      // Calculate the byte value based on its position in the repeat
      if (byteIndex == 2) {
          return 0x80 | repeatValue;  // Third byte with MSB set
      } else {
          return repeatValue;  // First and second bytes
      }
  }

  /*
  // Function to print the sequence in binary format for verification
  void printSequence() {
      for (int i = 0; i < TOTAL_SIZE; ++i) {
          std::cout << std::bitset<8>(getByteValue(i)) << " ";
          if ((i + 1) % 8 == 0) std::cout << std::endl;
      }
  }

  int main() {
      // Print the final sequence
      printSequence();

      return 0;
  }

  */

  /******************* Externs  ******************/
  DMA_DATA_TYPE *global_buffer_gclk_cdata   = NULL; // data for gclk + new payload of MBI serial colour data + vsync
  DMA_DATA_TYPE *global_buffer_configuration      = NULL; // for sending any other data

  lldesc_t *dma_ll_gclk_cdata = NULL;
  lldesc_t *dma_ll_configuration = NULL;

  /******************* ******  *******************/
  volatile bool dma_buffer_sent = false;
  static volatile int  interrupt_count = 0;


    static void IRAM_ATTR i2s_dma_isr(void* arg) {

      interrupt_count = interrupt_count + 1;

      // Clear flag so we can get retriggered
      SET_PERI_REG_BITS(I2S_INT_CLR_REG(I2S_NUM_0), I2S_OUT_EOF_INT_CLR_V,  1, I2S_OUT_EOF_INT_CLR_S);                      
      SET_PERI_REG_BITS(I2S_INT_CLR_REG(I2S_NUM_0), I2S_OUT_DONE_INT_CLR_V, 1, I2S_OUT_DONE_INT_CLR_S);                
      
      // at this point, the previously active buffer is free, go ahead and write to it
      dma_buffer_sent = true;

    }

    int get_interrupt_count(){
      return interrupt_count;
    }

    /*************************************************************************************/
    i2s_dev_t* getDev()
    {
        return &I2S0;
    }

    void _mbl_set_latch_for_config_buff(int latch_length, int &start_pos, bool stay_low = false) {

        for (int i = latch_length; i > 0; i--) {
          global_buffer_configuration[start_pos++].lat = (stay_low) ? 0:1;
#ifdef USE_PSRAM          
          Cache_WriteBack_Addr((uint32_t) &global_buffer_configuration[start_pos-1], sizeof(DMA_DATA_TYPE)); // Ensure written to PSRAM, needs to be a &reference[x].byteX !         
#endif          
        }
    }

    /* Need to set config for all MBI input on the panel at once as they all share the same latch pin */
    void _mbi_set_config_dma(int &dma_output_pos, uint16_t config_reg, bool latch, bool reg2) {

      ESP_LOGD(TAG, "_mbi_set_config_dma()");

