mrcodetastic/MBI5153-DMG1075-MatrixPanel-DMA/esp32s2_pio_Arduino_GFX_Lite/src/esp32s2_mbi5135_i2s_lcd_24bit_parallel_dma.cpp
      // Number of DCLK Rising Edge when LE is asserted
      // Write Configuration 1 = 4
      // Write Configuration 2 = 8
      int latch_trigger_point = (reg2) ? 8 : 4;

      for (int bit = 15; bit >= 0; bit--) {
        int bitval = ((config_reg >> bit) & 1);

          if (bitval) {
            // All PWM chips across all colour channels get the same config for now.
            global_buffer_configuration[dma_output_pos].b1 = global_buffer_configuration[dma_output_pos].b2 = global_buffer_configuration[dma_output_pos].b3 = global_buffer_configuration[dma_output_pos].b4 = 1;
            global_buffer_configuration[dma_output_pos].r1 = global_buffer_configuration[dma_output_pos].r2 = global_buffer_configuration[dma_output_pos].r3 = global_buffer_configuration[dma_output_pos].r4 = 1;
            global_buffer_configuration[dma_output_pos].g1 = global_buffer_configuration[dma_output_pos].g2 = global_buffer_configuration[dma_output_pos].g3 = global_buffer_configuration[dma_output_pos].g4 = 1;

          }

          if ((bit < latch_trigger_point) && (latch == true)) {  // for reg1, data latch on the last 4 bits when latch is true (on last send)
            global_buffer_configuration[dma_output_pos].lat = 1;
          }
#ifdef USE_PSRAM          
          // Write to PSRAM
          Cache_WriteBack_Addr((uint32_t) &global_buffer_configuration[dma_output_pos], sizeof(DMA_DATA_TYPE)); // Ensure written to PSRAM, needs to be a &reference[x].byteX !         
#endif
          dma_output_pos++; // increment

      }  // iterate through bits
    }  // mbi_send_config_dma

    void _mbi_load_config_reg1(int &buff_start_pos) {

      int ghost_elimination   = 0b11;
      int line_num            = 20 - 1;
      int gray_scale          = 0; // 14 bit
      int gclk_multiplier     = 0; // multiplier off
      int current             = 15;  // 0-63 is the range. 15 is good.

      // Documentation says set bits E and F of Config1 Reg to 1
      uint16_t config_reg1_val = 0; 
      config_reg1_val = (config_reg1_val | (ghost_elimination << 14) | (line_num << 8) | (gray_scale << 7) | (gclk_multiplier << 6) | (current));

      for (int i = 0; i < PANEL_MBI_CHAIN_LEN; i++) {
        _mbi_set_config_dma(buff_start_pos, config_reg1_val, (i == (PANEL_MBI_CHAIN_LEN - 1)), false);  // on last mbi chip, latch
      }

    }  // mbi_send_config_reg1_dma

    void _mbi_load_config_reg2(int &buff_start_pos) {

      // F E D C B A 9 8 7 6 5 4 3 2 1 0
      // uint16_t config_reg2_val = 0b0001000000010000; // default value apparently      
      uint16_t config_reg2_val = 0b1001000000011110;  // removes ghosting except for red

      for (int i = 0; i < PANEL_MBI_CHAIN_LEN; i++) {
        _mbi_set_config_dma(buff_start_pos, config_reg2_val, (i == (PANEL_MBI_CHAIN_LEN - 1)), true);  // on last mbi chip, latch
      }
    }  // mbi_send_config_reg2_dma

    // Static
    inline void _gpio_pin_init(int pin)
    {
      if (pin >= 0)
      {
        gpio_pad_select_gpio(pin);
        gpio_set_direction((gpio_num_t)pin, GPIO_MODE_OUTPUT);
        gpio_set_drive_capability((gpio_num_t)pin, (gpio_drive_cap_t)3);      // esp32s3 as well?
      }
    }

    // esp32 s2 only
    inline int i2s_parallel_get_memory_width(int width) {
      switch(width) {
      case 8:
        return 1;
      case 16:
        return 2;
      case 24:
        return 4;
      default:
        return -ESP_ERR_INVALID_ARG;
      }
    }


  /* @brief Split the payload up and link to from x DMA descriptors. Number of descriptors needs to have been calculated correctly by ll_desc_get_required_num
    *
    * @param uint32_t count   : Number of DMA descriptors required
    * @param size_t   payload : Total size in (bytes) of payload to be linked to.
    * @param void *buffer     : Pointer to the first address of contigurious chunk of payload data.
    * @param bool loop_back   : Loop output endlessly by linking last DMA descriptor to first.
    * 
    * @return Pointer to lldesc_t malloc of size: count * sizeof(lldesc_t)
    */
    static lldesc_t * allocate_dma_descriptors_gb(uint32_t count, size_t payload_size, void *buffer, bool loop_back = true)
    {
        lldesc_t *dma = (lldesc_t *)heap_caps_malloc(count * sizeof(lldesc_t), MALLOC_CAP_DMA);
        if (dma == NULL) {
            ESP_LOGE("allocate_dma_descriptors()", "Could not allocate lldesc_t memory.");            
            return dma;
        }

        int n = 0;
        while (n < count) 
        {

            int dmachunklen = payload_size;
            if (dmachunklen > DMA_MAX) {
                dmachunklen = DMA_MAX;
            }

            dma[n].size = dmachunklen;
            dma[n].length = dmachunklen;

            dma[n].sosf = 0;
            dma[n].eof = 0;
            dma[n].owner = 1;     // 1 = dma   

            //dma[n].buf = (buffer);
            dma[n].buf = (uint8_t*)(buffer);

            ESP_LOGD("allocate_dma_descriptors()", "Linking to payload buff at memory location 0x%08X.", (uintptr_t)dma[n].buf);                     

            payload_size -= dmachunklen;        
            //buffer += dmachunklen;  
            buffer = (uint8_t*)buffer + dmachunklen;  

            if ( n == (count-1) ) { // last element

              if (loop_back) {
                dma[n].empty = (uintptr_t)&dma[0];
                dma[n].eof = 1; // generate eof interrupt for the hell of it
                ESP_LOGD("allocate_dma_descriptors()", "Linking lldesc_t  pos %d back to pos 0", n);      
              }
              else
              {
                dma[n].empty = 0; // null
                ESP_LOGD("allocate_dma_descriptors()", "Terminating DMA descriptor linked list (EOF) at pos %d.", n);      
              }

            } else {
              dma[n].empty = (uintptr_t)&dma[(n  + 1) % count];
              ESP_LOGD("allocate_dma_descriptors()", "Linking lldesc_t  pos %d to pos %d at memory location %08x.", n, (n+1), (uintptr_t)&dma[(n + 1) % count]);      
            }
              ESP_LOGD("allocate_dma_descriptors()", "Chunk len %d.", dmachunklen);          


