mrcodetastic/MBI5153-DMG1075-MatrixPanel-DMA/esp32s2_pio_Arduino_GFX_Lite/src/esp32s2_mbi5135_i2s_lcd_24bit_parallel_dma.cpp
          actual_size = alloc_size_bytes;
#endif

          size_t alignment_offset = actual_size - alloc_size_bytes;      

          ESP_LOGI(TAG, "Actual size is: %d bytes", actual_size);  
          ESP_LOGI(TAG, "Alignment offset is: %d ", alignment_offset);        

          if (global_buffer_gclk_cdata == NULL)  {
                  ESP_LOGE(TAG, "global_buffer_gclk_cdata malloc failed.");
          } 

          // Zero out
          memset(global_buffer_gclk_cdata, 0, alloc_size_bytes); // zero it. 

#ifdef USE_PSRAM                         
          Cache_WriteBack_Addr((uint32_t) global_buffer_gclk_cdata, alloc_size_bytes);   
#endif

          // dma ll desc
          int dma_node_cnt = ll_desc_get_required_num(alloc_size_bytes); 
          dma_ll_gclk_cdata =  allocate_dma_descriptors_gb(dma_node_cnt, alloc_size_bytes, global_buffer_gclk_cdata, true);

        } // end gclk buffer allocation


        // Allocate the buffer for command and other crap
        {
          size_t alloc_size_bytes  = BUFF_BITLEN_CONFIG * sizeof(DMA_DATA_TYPE); 
          size_t actual_size = 0;

#ifdef USE_PSRAM
          ESP_LOGI(TAG, "Allocating PSRAM DMA memory for global_buffer_configuration.");  
          esp_err_t err = esp_dma_malloc(alloc_size_bytes, ESP_DMA_MALLOC_FLAG_PSRAM, (void **) &global_buffer_configuration, &actual_size);
          assert(err == ESP_OK);
#else
          ESP_LOGI(TAG, "Allocating internal SRAM DMA memory for global_buffer_configuration.");  
          global_buffer_configuration = static_cast<DMA_DATA_TYPE *>(heap_caps_malloc(alloc_size_bytes, MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA));
          assert(global_buffer_configuration != nullptr);
#endif
          size_t alignment_offset = actual_size - alloc_size_bytes;      

          ESP_LOGI(TAG, "Actual size is: %d bytes", actual_size);  
          ESP_LOGI(TAG, "Alignment offset is: %d ", alignment_offset);        

          if (global_buffer_configuration == NULL)  {
                  ESP_LOGE(TAG, "global_buffer_configuration malloc failed.");
          } 

          // Zero out
          memset(global_buffer_configuration, 0, alloc_size_bytes); // zero it.    

#ifdef USE_PSRAM                      
          Cache_WriteBack_Addr((uint32_t) global_buffer_configuration, alloc_size_bytes);   
#endif          

          // dma ll desc
          int dma_node_cnt = ll_desc_get_required_num(alloc_size_bytes); // Number of DMA nodes  xxxxx / 4092
          dma_ll_configuration =  allocate_dma_descriptors_gb(dma_node_cnt, alloc_size_bytes, global_buffer_configuration, false); //,false);     

        }       

        return ESP_OK;

    } // dma_allocate

    esp_err_t mbi_load_inital_dma_data() {

      { // block 0 vsync

          /*
          // Populate with vsync data 
          int start_pos = TOTAL_SIZE+(BUFF_BITLEN_VSYNC/2);
          int latch_length = 3; 
          for (int i = latch_length; i > 0; i--) {        
            global_buffer_gclk_cdata[start_pos++].lat = 1;                      
          }
          */
         dma_set_vsync();

      }

      { // block 1 gclk (no latches yet)

              // Part 1 - Load the GCLK data 
              // NOTE: As we use a bit in byte0 for the LATCH as well, we need to ensure this is written after this is loaded.
              //int bitlen = sizeof(dma_gclk_addr_full_clk_rate);
              int bitlen = TOTAL_SIZE;
              for (int i = 0; i < bitlen; i++) {
                    // Load it twice
                    global_buffer_gclk_cdata[i].byte0         = getByteValue(i);            
                    //global_buffer_gclk_cdata[bitlen+i].byte0 =  1; // getByteValue(i);            

#ifdef USE_PSRAM                              
                    Cache_WriteBack_Addr((uint32_t) &global_buffer_gclk_cdata[i], sizeof(DMA_DATA_TYPE)); // Ensure written to PSRAM, needs to be a &reference[x].byteX !   
                    Cache_WriteBack_Addr((uint32_t) &global_buffer_gclk_cdata[bitlen+i], sizeof(DMA_DATA_TYPE)); // Ensure written to PSRAM, needs to be a &reference[x].byteX !                     
#endif                    
              }

              // Part 2, the greyscale data latches in the right spot. Assume greyscale data will start from postion 0 in this buffer.
              int counter = 0;
              for (int row = 0; row < PANEL_SCAN_LINES; row++) { // rows
                for (int chan = 0; chan < PANEL_MBI_LED_CHANS; chan++) { // channels per chip
                  for (int ic = 0; ic < PANEL_MBI_CHAIN_LEN; ic++) {  // number of chained ICs

                   global_buffer_gclk_cdata[counter].lat = 0;

                    // data latch on the last bit, when sending the last byte set latch=1
                    int latch = 0;
                    if (ic == 4) {
                      latch = 1;
                    }  // latch on last channel / ic

                    int bit_offset = 16;
                    while (bit_offset > 0)  // shift out MSB first per the documentation.
                    {
                      bit_offset--;  // start from 15

                      if (latch == 1 && bit_offset == 0) {
                        global_buffer_gclk_cdata[counter].lat = 1;
              #ifdef USE_PSRAM                                  
                        Cache_WriteBack_Addr((uint32_t) &global_buffer_gclk_cdata[counter], sizeof(DMA_DATA_TYPE)); // Ensure written to PSRAM, needs to be a &reference[x].byteX !                               
              #endif                        
                      }
                      counter++;
                    }
                  }
                }
              } // end latch config for greyscale data      
        } //end block 1

        // Load configuration / Start-up Data
        {
              int start_pos = 10;
              ESP_LOGI(TAG, "0. Start Pos is: %d.", start_pos);              

              // Send Reset - 10 clocks of dclock rising edge
              _mbl_set_latch_for_config_buff(10, start_pos); 
              ESP_LOGI(TAG, "1. Start Pos is: %d.", start_pos);              

              // Stay low for a bit
              _mbl_set_latch_for_config_buff(2, start_pos, true); // stay low
              ESP_LOGI(TAG, "2. Start Pos is: %d.", start_pos);              

              // Send preactive - 14 clocks of dclock rising edge
              _mbl_set_latch_for_config_buff(14, start_pos); // stay low
              ESP_LOGI(TAG, "3. Start Pos is: %d.", start_pos);                          

              // Stay low for a bit
              _mbl_set_latch_for_config_buff(6, start_pos, true); // stay low
              ESP_LOGI(TAG, "4. Start Pos is: %d.", start_pos);         

              start_pos += 16; // add a bit of space                 

